/*
 * 	자바에서 제공하는 제어문 : 필요한 내용만 출력(조건문,선택문-다중조건문과 동일), 반복 수행, 반복 제어
 * ------------------- 연산자+제어문=메소드
 * 	반복 수행 : for, while, do~while
 * 	반복 제어 : 종료, 제외, break continue
 * 
 * 	1) 조건문 : 사용빈도가 가장 많다
 * 		=> 단일 조건문 : true일 때 수행 => 검색 => 검색어 입력 여부 확인, 상세보기
 * 		=> 선택 조건문 : true/false를 나눠서 수행 => 로그인 (로그인된 경우 / 로그인이 안된 경우)
 * 										   => 아이디 중복 (중복이 없는 경우 / 중복이 있는 경우)
 * 		=> 다중 조건문 : 조건 여러개 중에서 한개만 true로 수행 => 메뉴 클릭, 키보드 (키값) => 게임
 * 	
 */
public class 제어문_선택문_1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
