/*
 * 	프로그램 => 묶음 (관련된 내용을 묶어서 재사용)
 * 	------
 * 	데이터 관리		명령문 관리		출력 관리
 * 	--------
 * 	1) 한개씩 저장 후 관리
 * 	   ---- 변수 / 상수
 * 	2) 여러개를 동시에 저장 후 관리
 * 	   ---- 배열 / 클래스
 * 		배열 : 같은 데이터형을 묶어서 관리
 * 		클래스 : 다른 데이터형을 묶어서 관리
 * 	   ---------------------------- 메모리에 저장 (RAM => 프로그램 종료 시 사라진다)
 * 	3) 영구적인 저장 장치
 *		= 파일 : 보안 취약
 *		= *** 오라클 (RDBMS)
 *	=> 자바 + 오라클
 *		|	 (저장)
 *	   데이터를 읽어서 => 브라우저
 *
 *		브라우저 (자바는 일반 텍스트)
 *		------
 *		| HTML/CSS/JavaScript
 *			=> 오라클을 연결할 수 없다
 */
public class 메소드_1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
	}

}
