/*
 * 	1. 형식 => 어떤 곳에서 사용
 * 	2. 흐름 파악 => 동작 순서
 * 	3. 응용
 * 	---------------------
 * 	1) 제어문 : 프로그램 제어
 * 			  --------- 요청한 내용만 출력, 반복 수행, 선택된 내용만 출력
 * 						-------------  ------  -------------
 * 								ㅣ		반복문		선택문
 * 							필요 시에 건너뛸 수도 있다(if)
 * 
 * 			반복문 => 중단->break / 다시 시작->continue
 * 
 * 		=> 조건문 : 오류처리, 건너뛴다 ... 사용자 요청에 맞는 내용만 출력
 * 			단일조건문 : 독립적인 문장 (조건에 맞는 모든 문장을 수행, 1개만 수행 X)
 * 				=> true에 수행, false면 건너뛴다
 * 			선택조건문 : true/false => 나눠서 처리
 * 				=> if~else 형식 => if는 true에 수행, else는 false에 수행
 * 			다중조건문 : 여러개의 조건 중에 1개만 출력
 */
public class 제어문_조건문_7 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
