/*
 * 	변수 => 초기화 (프로그램에 필요한 데이터 값을 저장)
 * 	| 필요한 값을 지정
 * 	------------------
 * 	| 파일 읽기
 * 	| 웹 읽기 (크롤링)
 * 	| 메소드를 이용하는 방법
 * 	| 입력값을 받아서 처리
 * 	------------------ 선언이 아니라 구현
 * 					   ------------- 클래스 {} 안에서는 사용 불가능
 * 						| 초기화 블록 / 생성자
 *	= 선언과 동시에 값을 지정
 *		int a=100;
 *		나중에 값을 대입하는 것은 불가능
 *		-----------------------
 *		int a;
 *		a=100;
 *		-----------------------> 클래스 블록에서
 *	= 모든 클래스에는 생성자가 반드시 1개 이상이 존재한다
 *	= 생성자가 없는 경우에는 컴파일 시에 자동으로 1개 추가한다
 *
 *	*** 자바 프로그램에서 자동으로 추가되는 내용
 *	1. import java.lang.*;
 *			  ----------- String, Math, System
 *	2. extends Object : 모든 클래스는 Object
 *	3. 메소드 => void => return 생략
 *	4. 모든 클래스 생성자가 없는 경우 => 자동 추가
 */
public class 클래스_3 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
