/*
 * 	65page
 * 
 * 	반복 제어문
 * 		= for ***(많이 쓰임) => 화면 출력 = 갯수 확정 => 반복 횟수 지정
 * 		= while => 데이터베이스 = 무한 스크롤 => 반복 횟수 지정이 없는 상태
 * 	--------------------------------------------------------- 한번도 수행을 못할 수도 있다
 * 																=> 조건 : 선조건
 * 		= do~while => 빈도수가 거의 없다
 * 	--------------------------------------------------------- 무조건 한번 이상 수행
 * 																=> 조건 : 후조건
 */
public class 제어문_반복문_1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
