package com.sist.main;
/*
 * 	114page
 * 
 * 	1) 클래스의 구성요소 : 윈도우, 웹, 모바일
 * 	개발자가 클래스를 설계 => 인스턴스(객체)의 과정을 통하여 메모리에 저장
 * 		1. 클래스 설계
 * 		클래스 : 데이터만 관리 (변수 여러개를 모아서 관리) => 웹, 윈도우 => 전송 (데이터를 모아서 한번에 전송) => 상세보기
 * 				데이터 활용 (메소드를 여러개 묶어서 관리) => Manager (사용자 요청 시 => 처리)
 * 				액션 클래스 (동작을 정의)
 * 				데이터 + 메소드 => 혼합
 * 				------------------ 벤치 마킹 => 요구사항
 * 		2. 클래스 설계 내용
 * 		# 데이터 => 멤버변수
 * 		# 기능 => 메소드
 * 		# 필요 시 멤버변수의 초기화 : 생성자, static => static{}
 * 		-----------------------------------------------
 * 		= 멤버변수의 종류
 * 		인스턴스변수 : Heap => 메모리 공간을 만들어 동시에 저장 (연산자 new => 사용이 불가능 (프로그래머 관리))
 * 		정적변수 : Method Area => 모든 객체가 공통으로 사용하는 변수 (1개를 가지고 사용)
 * 				=> 변수 앞에 static => 변경하면 데이터값이 동시에 변경
 */
public class 클래스_114page {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
