package com.sist.util;
/*
 * 	Collection : 배열을 대처 => 가변형 (저장 개수를 지정하지 않는다) => 신축성
 * 
 * 	1. 컬렉션 프레임워크
 * 	= 다수의 데이터를 쉽고 효율적으로 처리할 수 있게 만든 표준화된 클래스의 집합
 *                                         ----- 모든 개발자가 동일하게 사용
 *	= 자료 구조 : 데이터 수정, 삭제, 추가, 읽기가 가능
 *                       -------- 배열은 불가능하다 (고정)
 * 	= 동적 메모리 할당 (가변형)
 * 		필요 시마다 데이터를 추가 or 삭제가 편리하다
 * 		=> 웹, 모바일 => 컬렉션을 이용해서 데이터 전송
 * 	= 단점 : 모든 데이터를 저장 가능하게 => Object로 되어 있다 => 객체 형변환
 * 		// 메소드 => 리턴형 / 매개 변수 => Object => 제네릭스 (프로그램에 맞게 데이터형을 변경해서 사용)
 */
public class 컬렉션_1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
